---
kind: property
id: P:Autodesk.Revit.DB.ColorFillScheme.CategoryId
source: html/7f1d0a3c-4194-f165-0203-5aba9431a1b8.htm
---
# Autodesk.Revit.DB.ColorFillScheme.CategoryId Property

Represents the element category that can be colored by this scheme.

## Syntax (C#)
```csharp
public ElementId CategoryId { get; }
```